of7/SbmBloodFoam/tutorials/2DSimpleShearFlow_blood/0/J
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      J;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet           
    {
        type            zeroGradient;
	  
    }

    outlet          
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            slip;
    }

    upperWall       
    {
        type            slip;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
